In [ ]:
# Part 1 - SERIES
 # series very similar to a numpy array. But a series can have axis 
    # labels meaninng it can be indexed by a label

In [2]:
import numpy as np
import pandas as pd

In [3]:
# lets make various series from various object types

In [4]:
# make 4 python objects 
labels = ['a','b','c']           #list with strings
my_data = [10,20,30]             #list with numbers
arr = np.array(my_data)          #numpy array
d = {'a':10, 'b':20, 'c':30}     #dictionary

In [5]:
# create a series 
pd.Series(data = my_data)
# looks like numpy array except we have index and data
# key to a pandas series is you can specify what you want that index
   # to be

0    10
1    20
2    30
dtype: int64

In [6]:
# Specify what you want the index to be
pd.Series(data = my_data,index = labels)
# UNLIKE A NUMPY ARRAY WE HAVE AN INDEX THAT ARE LABELED AND WE CAN 
   # CALL DATAPOINTS USING LABELED INDEX

a    10
b    20
c    30
dtype: int64

In [7]:
# same as above but above is better practice
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
# a few more ways to make a series:
# pass in a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data = arr,index = labels)

# OR

pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [11]:
d

{'a': 10, 'b': 20, 'c': 30}

In [10]:
# pass in dictionary
# pandas automatically takes the keys of dictionary and set it as an
   # index and then set the value of that key to the corresponding 
       # data point
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
#A Pandas Series can hold a variety of object types and almost any type
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [14]:
# series can also hold strings to
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [15]:
# Can even pass in built in functions
pd.Series(data=[sum,print,len])
# so this hold references to built in functions as datapoints

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [ ]:
# Using the Index
# Key to using a series is understanding the index

In [ ]:
# Grab info from a series

In [17]:
# create 2 series
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])
ser1
# 1234 are datapoint, index is countries

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [20]:
# grab info out of the series - works similar to dictionary
# so---series[index label]
ser1['USA']
#keep in mind typing index as string because we know index 
  #is a str

1

In [23]:
ser1[0]

1

In [24]:
ser1[1]

2

In [26]:
ser3 = pd.Series(data=labels)
ser3
# dtype is object which is a string

0    a
1    b
2    c
dtype: object

In [28]:
ser3[0]

'a'

In [ ]:
# for operations to do with a series they are usually done 
  # based off the index

In [29]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [30]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [32]:
# add both series
ser1 + ser2
# it will show NAN for a value it can't find a match to
# Can't find match because we don't have 'italy' or 'ussr'
  # in each series

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [ ]:
# Something to note - when you are performing operations with
   # a pandas series your integers will be converted to FLOATS
     # so you don't lose information

In [ ]:
# Part 1 - DATAFRAMES

In [33]:
import numpy as np
import pandas as pd

In [35]:
from numpy.random import randn

In [38]:
# set a seed which means we get the same random numbers so 
  # i can get same numbers as instructor
np.random.seed(101)

In [39]:
# Explode dataframe command
# pass in data argument , index , columns
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df
# so this gives us a list of collumns in corresponding rows
# each column is a PANDAS SERIES
# They all share a common index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
# How to use indexing and selection to series object or several
   # columns
df['W']  
# now this looks like a series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [41]:
type(df['W'])

pandas.core.series.Series

In [42]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
# so we see dataframe is just a bunch of series that share 
  # same index

In [ ]:
# 2 different ways to grab a column 
    # bracket notation with column name- BEST WAY
    # dot notation - BAD practice bc it may get confused with 
        # the various methods available to use off a dataframe

In [43]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [46]:
#multiple columns pass in a list of columns -use double brackets
df[['W','Z']]
# this gives us a Dataframe since we have more than one column
# a single column gives us a series

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [47]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [48]:
# Creating a new column
# create new columns called 'new'
df['new'] = df['W'] + df['Y']
df['new']

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: new, dtype: float64

In [49]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [50]:
# to remove colums 
# use df.drop
df.drop('new')
# we get an error because it defaults to axis=0 which refers to 
   # the index
# get an error because we don't have an index 'new'
# to refer to colums set axis=1

KeyError: "['new'] not found in axis"

In [53]:
# to refer to colums set axis=1
df.drop('new', axis=1)
# must do it INPLACE
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [54]:
# does this so we don't accidently lose data
df.drop('new', axis=1, inplace=True)

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
# Remove rows - use df.drop() 
# remove the 'E' row
df.drop('E', axis=0)  # axis=0 default but good practice

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
# why are rows 0 and why are columns 1?
df.shape
# we see that df.shape is a TUPLE for a 2D matrix 
# at the 0 index are the number of rows!
# and on index 1 we have 4 columns

(5, 4)

In [67]:
# Selecting rows
# remember for columns:
df[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
C  0.528813  0.740122
D -0.933237 -0.758872
E  2.605967  1.978757

In [68]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# 2 ways to select rows in df:
   # 1st way-LOC method -use for location or label based index
   # 2nd way-Based off index position ILOC-use for numerical 
        #based index

In [69]:
# LOC method - takes in a label
# pass in the row you want
df.loc['A']
# returns a SERIES
# SO NOT ONLY ARE COLUMNS SERIES BUT THE ROWS ARE ALSO SERIES

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [70]:
# ILOC
# pass in a numerical index even if axis is labeled by string
# grab 'C'
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [71]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
# Selecting subsets of rows and columns
# pass in with comma notation row and column we want
# want value at row B colum Y
df.loc['B','Y']

-0.8480769834036315

In [74]:
# if you want subset of this
# pass in a list separated by commas
# say we want A, B rows with  W, Y columns
# pass in list with rows we want, columns we want
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [ ]:
# Part 2 DATAFRAMES
# - Conditional Selection and Multi Index Parts of DF

In [76]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [77]:
# use same DF in last video
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# Conditional Selection
#.  uses bracket notation

In [78]:
# similar to same conditional selection applied to a numpy 
   # array except we doing it with pandas dataframes
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [80]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [81]:
df[booldf]
# we get NANs where it was false

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
# better way
# more common to pass in a row or column value
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
df['W'] > 0
# get a series back
# this is linked to the index
# CAN NOW USE THIS TO FILTER OFF ROWS BASED OFF A COLUMNS VALUE

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [86]:
df[df['W']>0]
# will only get back rows where this is TRUE 
#SINCE WE ARE PASSING IN A SERIES WE DON'T GET THOSE NULL 
   #VALUES ANYMORE.
#WE ONLY GET THOSE NULL VALUES WHEN WE PASS IN AN ENTIRE 
    #DATAFRAME LIKE WE DID ABOVE
#WHEN WE PASS IN CONDITIONS BASED ON COLUMNS WE GET SERIES 
    #VALUES
  #MEANING WE ONLY GET ROWS WHERE IT IS TRUE - USED MOST OFTEN

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [94]:
# grab all rows in DF where 'Z'<0
df[df['Z']<0]
# WE GET A DATAFRAME
   # WHICH MEANS WE CAN CALL COMMAND OFF THIS DATAFRAME

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [98]:
resultdf = df[df['W']>0]
resultdf
# so no we can call results off of this

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [99]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [101]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [100]:
# Can do this is one step
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [103]:
# since this is a dataframe we can stack commands like bracket 
   # notation on top of it, such as returning 'X' column
# Get W>0 and want to show X column values with it
df[df['W']>0]['X']
# now we get same thing as above except done in one step

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [104]:
# Can even get multiple columns - pass in list
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [110]:
boolser = df['W']>0
boolser
# get a boolian series back

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [113]:
result = df[boolser]
result
# We only get back values where the Bool-series was true

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [115]:
# Call a list of columns off result
mycols = ['Y','X']
result[mycols]
# Get same thing as above

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [114]:
### ORR
result[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [116]:
### Summary - just doing same thing again
# Get colums where W>0 and show 'Y' and 'X'
df[df['W']>0][['Y','X']]  # much more efficient than below

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [117]:
# takes more time and more lines to write this
boolser = df['W'] > 0
result = df[boolser]
mycols = ['Y', 'X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [ ]:
# Using multiple conditions

In [120]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [118]:
# Get W>0 and Y>1
# common mistake people do in python:
df[(df['W']>0) and (df['Y']>1)]
# PYTHON AND FUNCTION CANT TAKE INTO ACCOUNT A SERIES OF BOOLIAN
  # VALUES COMPARED TO ANOTHER SERIES OF BOOLIAN VALUES
# AN AND OPERATOR CAN ONLY TAKE IN SINGLE BOOLIANS AT A TIME

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [122]:
# When we want multiple comditions use an AMPERSAND (&)
# so AMPERSAND replaces AND
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [124]:
df[(df['W']>0) or (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [123]:
# If we want do OR operation use PIPE OPERATOR (|)
# PIPE OPERATOR replaces OR
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# Resetting the Index or Setting it to something else

In [125]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [126]:
# Reset index to a numerical value
# To reset the index back to the default (just range index
   # 0,1,2,3,4 all the way up to nth row)
#   Can call reset_index() method
       #must specify if you want inplace
df.reset_index()
#so we get the index reset to a column and actual index is
    #numerical
# so old index becomes a column

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [129]:
# Setting the index
# create a new index
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [127]:
# .split() common method for splitting off blank space
   # nice way to create a list instead of typing every comma
'CA NY WY OR CO'.split()

['CA', 'NY', 'WY', 'OR', 'CO']

In [131]:
# Add newind as column in DF
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [132]:
# Set new column as Index
# set states as the index
   # use.   -- .set_index('col name')
# Must add inplace
df.set_index('States')
# KEEP IN MIND THIS OVERWRITES OLD INDEX AND WON'T RETAIN
   # THE INFO AS A NEW COLUMN UNLIKE RESET INDEX WHICH ALLOWED
     # YOU TO KEEP THAT INFORMATION

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [ ]:
# Part 3 - DataFrams - Part 3
  # Multi Index and Index Heirarchy

In [ ]:
import numpy as np
import pandas as pd

In [146]:
# copy lines of code from dataframes notebook
# This code is not that important to remember

# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
   #used list function and ZIP to combine lists as TUPLE
hier_index = pd.MultiIndex.from_tuples(hier_index)
  # not used during this course but this function is for 
      # a customization of making a dataframe

In [140]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [141]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [147]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [151]:
# 6 rows and 2 columns
# hier index is what our index is set to
# columns are A and B
# remember this is only used for contructing a multi index
   # data frame so not that important 
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [152]:
# how to call data from a multi level index
# grab everything under G1
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [153]:
# continuing indexing off of it
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [154]:
df.index.names
# pandas index names object types just saying that the indecies
   # don't have any names

FrozenList([None, None])

In [155]:
# lets name the indexes - pass in list of names
df.index.names = ['Groups', 'Num']

In [156]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [157]:
# Grab info from it
# grab G2 - 2 - B - .1968
# grab outside in
df.loc['G2']

            A         B
Num
1    0.238127  1.996652
2   -0.993263  0.196800
3   -1.136645  0.000366

In [165]:
df.loc['G2'].loc[2]

A   -0.993263
B    0.196800
Name: 2, dtype: float64

In [163]:
df.loc['G2'].loc[2]['B']

0.19679950499134005

In [164]:
# OR
df.loc['G2'].loc[2][1]

0.19679950499134005

In [ ]:
# Cross Section. (xs)
 # returns a cross section of rows or columns from a series or
    #DF. Used when you have a multi level index

In [166]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [167]:
# grab everything under G1
df.loc['G1']

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [168]:
#But another option for a multi level index is Cross Section(xs)
df.xs('G1')
# Cross Sectioning has the ability to skip or go inside a multi
   #level index

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [ ]:
# Grab all values of Num=1 (with both Groups)
# Best to use CROSS SECTION method for this
    # .loc method is confusing to do for this

In [169]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [170]:
# First argument (1) - specify what you want
#level = name of index
df.xs(1,level='Num')

# NOT THAT USEFUL BUT WILL USE SOMETIMES TO GET STOCK INDEX DATA
  # AND WE USE THIS LATER ON IN PROJECTS

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [ ]:
# Lecture 4 - Missing Data

In [ ]:
import numpy as np
import pandas as pd

In [171]:
# create a DF from a dictionary
#Columns(KEYS) - A,B,C
#Must pass in list of values for each key
# NP.NAN to signify a null value
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [172]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [173]:
# Drop NA method - drop ANY ROW with any null value
# so by default axis=0 so occurs along rows
df.dropna()

     A    B  C
0  1.0  5.0  1

In [174]:
# Drop NA - for columns
# axis=1
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [175]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [176]:
# Can specify a threshold
# threshhold - integer value
    #require that many non NA values in order to not get dropped
# Row0 - 3 non NA values
# Row1 - 2 non NA values
# Row2 - 1 non NA value
df.dropna(thresh=2)
# row1 gets kept because it had at least 2 non NA values
# so row2 will get dropped BC it has only 1 non NA value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [177]:
# FillNA
  # used to replace missing values
# Value - used to set in fill value
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [179]:
#Fill in the value with the mean of the column for 'A'
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64